# <center>Pandas Python Library for Beginners in Data Science
#### <center>Instructor: Vinita Silaparasetty

### Import Libraries

In [2]:
import numpy as np
import pandas as pd

# <center> Creating a Series

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/series.png?raw=true" width="600" height="600">

### <center> Method 1: Using an Array

In [5]:
s = ([1, np.nan,' Pandas library '])
print(type(s))
s1 = pd.Series(s)

s1

<class 'list'>

0                   1
1                 NaN
2     Pandas library
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s2, containing the following:

* Integer = 2

* Nan value

* Character = b

In [6]:
s = [2, np.nan, ' b ']
print(type(s))
s2 = pd.Series(s)
s2

<class 'list'>

0      2
1    NaN
2     b
dtype: object

### <center> Method 2: Using a List

In [7]:
list1 = ['animal', '2', 'animal']

s3 = pd.Series(list1)

s3

0    animal
1         2
2    animal
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s4.
Use a list, named list2, containing the following:

* Integer = 3

* Character = c

* String = Numpy 

Note:'N' Must be capital

In [8]:
list2 = [3, 'c', ' Numpy ']
s4 = pd.Series(list2)

s4

0          3
1          c
2     Numpy
dtype: object

### <center> Method 3: Using a Dictionary

In [9]:
s5 = pd.Series(
  {'A':1,
  '3' : 'Python'}
)
s5

A         1
3    Python
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s6, containing the following:

* 'Integer' = 3
* 'B' = Boys

In [11]:
s6 = pd.Series(
  {
      'Integer' : 3,
      'B': 'Boys'
  }
)

s6

Integer       3
B          Boys
dtype: object

# <center> Creating Data Frames

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/dataframe.gif?raw=true" width="600" height="600">

### <center> Method 1: Passing a Numpy Array

In [6]:
df = pd.DataFrame(np.random.randn(6,4))

df.head

<bound method NDFrame.head of           0         1         2         3
0  1.555085 -1.674342  0.714367 -0.898111
1  0.192846 -0.942453  0.278231  1.150664
2 -0.737375 -1.486565  1.322233  0.700129
3  0.586831 -1.789927 -0.905973  0.004945
4 -0.619838 -0.852126  0.587236  1.774010
5  1.687208 -0.836094 -0.014811  1.606014>

## <center>üèÜ Challenge

Create a data frame, named df1, which contains:

* A randomly generated array with the dimensions 3x3.

In [8]:
df1 = pd.DataFrame(np.random.randn(3,3))

df1.head()

          0         1         2
0  1.120629  0.883376 -1.283481
1 -1.964056 -0.174606 -0.048074
2 -0.361716 -0.262485  0.879799

### <center> Method 2: Passing a Dictionary of Objects

In [9]:
df2 = pd.DataFrame({
    'A' : 1,
    'number' : np.array([6]*3,dtype = 'int32'),
    
})

df2

   A  number
0  1       6
1  1       6
2  1       6

## <center>üèÜ Challenge

Create a data frame, named df3, which contains:

* 'E' = np.array([4] * 5,dtype='int32')

* 'Day' = 2

In [11]:
df3 = pd.DataFrame({
    'E' : np.array([4]*5, dtype='int32'),
    'Day' : 2
})

df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

--------

## <center> Importing Files

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

In [13]:
df4 = pd.read_csv('practicedata.csv')

df4.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

-----------------

## <center>üèÜ Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

In [14]:
df5 = pd.read_json('practicedata.json')

df5.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

In [18]:
df6 = pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
print(df6.shape)
df6.head(10)

(8, 4)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Create the data frame df7.

Then import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [20]:
df7 = pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
print(df7.shape)
df7.head(6)

(8, 4)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241

## <center> Export Files

### Export .csv Files

In [21]:
df4.to_csv('newcsv.csv')

## <center>üèÜ Challenge

Export the data from df4 to 'practicedata2.json'

Use the file path:/home/rhyme/Desktop/Project/

In [22]:
df4.to_json('newjson.json')

## <center>Data Summary
    
We will be working with data frame df6 for this section.

In [23]:
#first run this cell to create the data frame df6
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Quick Summary of Data

In [24]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 384.0 bytes

### Detailed Summary of Data

In [25]:
df6.describe()

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

## <center>View Columns

In [27]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>üèÜ Challenge
    
View the columns in df7.

In [28]:
#first run this cell to create the data frame df7
df7 = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df7

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

In [29]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>View Datatypes

In [32]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>üèÜ Challenge
    
View the datatypes in df7

In [33]:
df7.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>Handling Duplicates

### Detect Duplicate Rows

In [34]:
df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

### Drop Duplicate Rows

In [35]:
df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop duplicates in df7

In [40]:
#Detect duplicate rows.
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [41]:
#Drop duplicated rows.
df7.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>Handling Missing Values

### Detect Missing Values

In [42]:
print(df6.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

### Drop Missing Values

In [43]:
df6.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop missing values in df7

In [44]:
#Detect missing values
print(df7.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [45]:
#Drop missing values
df7.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>Numeric Operations

We will work with the data frame df8.

In [46]:
#first run this cell to create the dataframe df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0  0.075367 -0.818076  0.299163 -3.136771
1  1.589495  0.985977 -0.260285  0.218775
2 -0.385515  1.413656 -0.848975 -0.164641
3 -1.473824 -0.451557 -0.891452 -0.932816
4 -0.069719 -0.237754 -1.237883 -0.444997
5 -0.468830 -1.454079 -0.941637  1.734608

### Calculate the Mean:

In [55]:
df8.mean()

0   -0.122171
1   -0.093639
2   -0.646845
3   -0.454307
dtype: float64

## <center>üèÜ Challenge
    
Calculate the mean of df9

In [56]:
#first run this cell to create df9
df9 = pd.DataFrame(np.random.randn(3,4))
df9

          0         1         2         3
0 -1.032025  1.431846 -0.666353 -0.224438
1  1.394110  0.507621 -0.456051 -0.222561
2 -1.300060  0.452010 -0.185159 -1.523426

In [57]:
df9.mean()

0   -0.312658
1    0.797159
2   -0.435854
3   -0.656808
dtype: float64

### Calculate the Cumulative Sum:

In [58]:
df8.apply(np.cumsum)

          0         1         2         3
0  0.075367 -0.818076  0.299163 -3.136771
1  1.664861  0.167901  0.038878 -2.917996
2  1.279346  1.581557 -0.810097 -3.082637
3 -0.194478  1.130000 -1.701549 -4.015453
4 -0.264197  0.892247 -2.939431 -4.460450
5 -0.733027 -0.561833 -3.881068 -2.725842

## <center>üèÜ Challenge
    
Calculate the cumulative sum of df9

In [59]:
df9.apply(np.cumsum)

          0         1         2         3
0 -1.032025  1.431846 -0.666353 -0.224438
1  0.362085  1.939467 -1.122404 -0.447000
2 -0.937975  2.391477 -1.307563 -1.970425

### Find the Maximum Value:

In [61]:
df8.max()

0    1.589495
1    1.413656
2    0.299163
3    1.734608
dtype: float64

## <center>üèÜ Challenge

Find the maximum value of df9

In [62]:
df9.max()

0    1.394110
1    1.431846
2   -0.185159
3   -0.222561
dtype: float64

### Find the Minimum Value:

In [63]:
df8.min()

0   -1.473824
1   -1.454079
2   -1.237883
3   -3.136771
dtype: float64

## <center>üèÜ Challenge

Find the minimum value of df9

In [64]:
df9.min()

0   -1.300060
1    0.452010
2   -0.666353
3   -1.523426
dtype: float64

## <center>String Manipulation

We will work with the series s7 for this section.

In [65]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

### Convert to Lower Case

In [66]:
s7.str.lower()

0               animal
1                 bird
2     pandas library
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to lower case.

In [84]:
#first run this cell to create the series s8.
s8 = np.array(['cat ','dog','Python Programming '])
s8 = pd.Series(s8)
s8

0                   cat
1                    dog
2    Python Programming
dtype: object

In [68]:
s8.str.lower()

0                    cat
1                    dog
2    python programming
dtype: object

---------------

### Convert to Upper Case

In [69]:
s7.str.upper()

0               ANIMAL
1                 BIRD
2     PANDAS LIBRARY
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to upper case.

In [70]:
s8.str.upper()

0                    CAT
1                    DOG
2    PYTHON PROGRAMMING
dtype: object

### Swap Capitalization

In [71]:
#means lower case becomes uppercase and vice versa.
s7.str.swapcase()

0               ANIMAL
1                 BIRD
2     pANDAS lIBRARY
dtype: object

## <center>üèÜ Challenge

Swap the capitalization of the strings in s8.

In [72]:
s8.str.swapcase()

0                    CAT
1                    DOG
2    pYTHON pROGRAMMING
dtype: object

### Find Length of String

In [73]:
s7.str.len()

0     6
1     4
2    17
dtype: int64

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [85]:
s8.str.len()

0     4
1     3
2    19
dtype: int64

-------------

### Split String

In [75]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [76]:
#first run this cell to create the series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8= pd.Series(s8)
s8

0                      cat
1                      dog
2     Python Programming
dtype: object

In [77]:
s8.str.split()

0                    [cat]
1                    [dog]
2    [Python, Programming]
dtype: object

### Detect Unique Values

In [78]:
#
s7.unique()

array(['animal', 'bird', ' Pandas Library  '], dtype=object)

## <center>üèÜ Challenge

Detect unique values in s8.

In [79]:
s8.unique()

array(['cat', 'dog', ' Python Programming  '], dtype=object)

### Repeat String

We will work with the series s7 for this section.

In [80]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

In [81]:
repeat_list = [2,3,2]
s7.str.repeat(repeat_list)

0                          animalanimal
1                          birdbirdbird
2     Pandas Library   Pandas Library
dtype: object

## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [83]:
repeat_list = [1,2,3]
s8.str.repeat(repeat_list)

0                                                  cat
1                                               dogdog
2     Python Programming   Python Programming   Pyt...
dtype: object